const rstText = """
# 【
【ja: きな粉で作るヨーグルト】
【en: Yogurt made of kinako】
】

.. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/74dcb3267bee0a4e6a1e42a62c43f9fc84da2b53/kinakoyogurt.jpg

きな粉に水を加えて乳酸菌で発酵することによって作られるヨーグルトのような食品について紹介します。
味は牛乳で作ったヨーグルトに似ています。
きな粉ヨーグルトで検索するとヨーグルトにきな粉を加えたものに関する情報ばかりでてくるので
ここではきな粉に水を加えて発酵させたものをきな粉のヨーグルトと呼びます。
この記事の内容を試す場合は自己責任で行ってください。

.. contents::

## きな粉のヨーグルトを作るメリット

### 安い

業務用スーパーで1kgのきな粉が約300円で売られています。
きな粉のヨーグルトはきな粉1kgに水を約2kg加えて3kg作ることができます。
なので1kgあたり約100円で作ることができます。
牛乳や豆乳が1ℓあたり100円で売られることはあまりないと思うので牛乳や豆乳からヨーグルトを作るときより安くなります。
(しかしスーパーによってはそれほど安いきな粉が売られてなかったりするようですが)

また安くたんぱく質を得ることができます。
きな粉の袋の栄養成分表示によると100gあたり36.7gのたんぱく質が含まれています。
よって100gあたりのたんぱく質の値段は300円 / (36.7g * 10) * 100 = 81.7円/100gとなります。
鶏卵100gあたりのたんぱく質は12.2g、Mサイズの卵は約60gなので10個入りが120円だとすると
100gあたりのたんぱく質の値段は120円 / (12.2g / 100g * 60g * 10) * 100 = 164円/100gとなります。
鶏むね肉皮付きの100gあたりのたんぱく質は21.3gなので2kgが900円で売っていたとすると
100gあたりのたんぱく質の値段は900円 / (21.3g / 100g * 2000g) * 100 = 211円/100gとなります。

### 水分の割合を調整できる

きな粉は乾燥した状態で売られているのでヨーグルトにするには水分を加える必要があります。
加える水の量を減らすだけで濃厚で固めにできます。

### 栄養

栄養士ではないのできな粉のヨーグルトに含まれる栄養成分や体にどのような影響があるのかは正直わかりません。
きな粉は大豆を炒めて皮をむき粉にしたものなので、皮を除いた大豆そのままと言えます。
`豆乳 <https://ja.wikipedia.org/wiki/%E8%B1%86%E4%B9%B3>`_ は、大豆を水に浸してすりつぶし、水を加えて煮つめた汁を漉したものです。煮詰めた汁を濾して残ったのがおからです。
ですのできな粉のヨーグルトの栄養成分は豆乳ヨーグルトとおからを合わせたものとほぼ同じではないかと思います。

### その他

- 材料のきな粉は常温で保存可能。未開封であれば10ヶ月ぐらいもつようです

## きな粉のヨーグルトを作る方法

### 材料

- きな粉
- 水
  - きな粉の質量の2倍
- 乳酸菌を含んだ食品(スーパーで売っている大豆ヨーグルトなど)
  - 自分はmarusanの豆乳グルトを使っています
  - 作ったヨーグルトを繰り返し種に使うと雑菌が増えることがあるらしいので避けたほうがいいでしょう。 

### 必要な物

- きな粉のヨーグルトを入れる清潔な袋または容器
  - 発酵途中で気体が発生して膨張する場合があるので大き目のものを用意したほうがいいです。

### 作り方

きな粉と水を混ぜた後は牛乳や豆乳からヨーグルトを作るときとほぼ同じです。

1. 容器にきな粉と水と乳酸菌を含んだ食品を入れて全体が均一になるまで混ぜます。
   豆乳ヨーグルトはきな粉1kgあたりスプーン大さじ5杯ぐらい入れます。
   一度に水を全部いれるより半分つづ入れたほうが混ぜやすいです。

   .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/74dcb3267bee0a4e6a1e42a62c43f9fc84da2b53/inbag.jpg

1. 発酵させます。
   約40度に温めて乳酸菌を増やします。
   45度ぐらいに温めたお湯に入れるかヨーグルトメーカなどを使って保温します。
   数時間温めて乳酸菌が増えれば室温ぐらいでも発酵するようです。
   このときに気体が発生して容器が膨らむことがあります。
   marusanの豆乳グルトを使うと発生することはあまりありませんが、それでも発生するときがあります。
   容器が破裂しないように中の空気を抜いたりヨーグルト内の気体を混ぜて取り除きましょう。

1. 発酵したら冷蔵庫に入れましょう。

完成したら砂糖、はちみつ、果物などを入れて食べましょう。

## 水以外の飲み物からきな粉のヨーグルトを作れるか

上で紹介したきな粉のヨーグルトはきな粉に水を混ぜてから発酵させますが、水の代わりに別の飲み物を混ぜるとどうなるのでしょうか。
以下の飲み物を使ってきな粉のヨーグルトを作ってみました。

- 牛乳

  一般的なヨーグルトは牛乳を発酵させて作ります。
  きな粉と牛乳を混ぜて発酵することができれば濃厚な牛乳ときな粉のヨーグルトができるかもしれません。

  .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoAndMilk.JPG

  200gのきな粉に400gの牛乳とmarusanの豆乳グルトおおさじ1杯を加えて混ぜました。

  .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoAndMilkMixed.JPG

- 野菜ジュース

  野菜ジュースは健康によさそうなのできな粉と野菜ジュースを混ぜて発酵させれば健康によさそうなヨーグルトができるかもしれません。

  .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoAndVegi.JPG

  200gのきな粉に190gの野菜ジュース2本とmarusanの豆乳グルトおおさじ1杯を加えて混ぜました。

  .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoAndVegiMixed.JPG

- コーラ

  世界には飲料水よりコーラが安い地域があるとかないとか。
  もし飲料水がないけどコーラときな粉があるときにきな粉のヨーグルトを作ることはできるのでしょうか。

  .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoAndCola.JPG

  200gのきな粉に400gのコーラとmarusanの豆乳グルトおおさじ1杯を加えて混ぜました。

  .. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoAndColaMixed.JPG

それぞれの材料を混ぜた直後を比較した画像です。

.. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/beforeHakkou3.JPG

材料を混ぜたものを入れた袋を約45℃のお湯に数時間入れた後に二日間ほど常温で放置しました。
その後冷蔵庫に二日間入れて冷やしました。
袋の上から触った感じでは3つとも発酵前より固くなっており、特に牛乳を入れたものが一番固くなっていました。

.. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/afterHakkou3.JPG

左から順場に水、牛乳、野菜ジュース、コーラ。

.. image:: https://gist.githubusercontent.com/demotomohiro/f3ae06fe68f32fa9626f429b6e3f33ec/raw/183126300d97d27ea783a8badbe3003fa9b141e9/kinakoH2OMilkVegiCola.JPG

水で作ったものは独特の匂いがして味は酸っぱいです。きな粉の味はほぼ残っていません。

牛乳で作ったものはヨーグルトよりチーズに近い味がします。

野菜で作ったものは少し甘みと酸味があります。野菜ジュースの味が少し残っています。

コーラで作ったものは甘くて少しコーラっぽい香りがします。あまり発酵していないのか酸味がわずかできな粉の味が残っている感じがします。
コーラだけで作らずに水をある程度混ぜたほうがよかったかもしれません。

この中では水で作ったものが一番酸っぱいです。
原因が他の3つとは別に作っていて常温で4〜5日ほど発酵させていたせいなのか、水以外の飲み物では水分が足りないせいなのかはわかりませんが。
いちおうきな粉と牛乳または野菜ジュースでヨーグルトを作ることができるとわかりました。
コーラでも多少固まってますが成功したと言えるか微妙です。

## きな粉のヨーグルトを作る方法を見つけたきっかけ

業務用スーパーできな粉1kgが約300円と安く売られていたのでこれを使って何かおいしいものを作れないかと考えていました。
最初はきな粉から納豆を作ろうと納豆ときな粉と水を混ぜて瓶に入れて蓋をして発酵させたのですが
納豆にならずヨーグルトのような味のものができました。
後で調べたところ、納豆菌は空気がないと繁殖できない好気性で乳酸菌は増殖に酸素を必要としない嫌気性らしいです。
きな粉と水を混ぜて加熱した後に納豆を加えて空気に触れるようにしたところ、表面が白っぽくなり納豆のようなものができました。
しかし市販の納豆よりだいぶ臭くなったのでこれ以上作るのをやめました。
豆乳からヨーグルトが作れるなら同じ大豆から作られたきな粉でもヨーグルトが作れるはずだと思い納豆の代わりにヨーグルトを作ることにしました。

インターネット上では牛乳や豆乳からヨーグルトを作る方法を解説したサイトがたくさん見つかるのですが
きな粉からヨーグルトを作る情報が見つかりません。
きな粉ヨーグルトで検索してもヨーグルトにきな粉を入れたものに関する情報しか見つかりません。
誰もきな粉からヨーグルトを作った人がいないのか、検索の仕方が悪いのか、きな粉からヨーグルトを作ってはいけないのか?

"""

let articles = newTable([
  (Lang("ja"),
  ArticleSrcLocal(
    title:"きな粉で作るヨーグルト",
    description:"きな粉から作られるヨーグルトについて説明します。",
    category:"Foods")),
  (Lang("en"),
  ArticleSrcLocal(
    title:"Yogurt made of kinako",
    description:"Explains about yogurt-like taste food made of kinako",
    category:"Foods"))])
newArticle(articles, rstText)
